#include <stdio.h>
#include <locale.h>

int main(void) {

    char *locale = setlocale(LC_ALL ,"");
    int t_f1 = 0;
    int t_f2 = 0;
    int t_f3 = 0;
    int t_f4 = 0;
    int t_f5 = 0;
    int t_f6 = 0;
    int t_f7 = 0;
    int t_f8 = 0;
    int t_f9 = 0;
    int t_f10 = 0;
    int t_f11 = 0;
    int t_f12 = 0;
    int Med_F = 0;
    char ch;

	printf("Програма обчислює середню температуру за рiк у Фаренгейтах й переводить середньомiсячну температуру й середньорiчну температуру в шкалу Цельсiя.\n");
	printf("Розробник - студент ЦНТУ Небесний Андрій Вадимович; розроблено в 2020 (с).\n");

	do{
        printf("\n===========================================================\n");
        printf("Введiть температуру у шкалі Фаренгейта в сiчнi: ");
        scanf("%d", &t_f1);
        if(t_f1 > 140 || t_f1 < -93){
            printf("Невiрно введенi температури.\n");
            printf("Бажаєте зробити розрахунки наново: ");
            ch = getch();
            continue;
        }
        printf("Введiть температуру у шкалi Фаренгейта в лютому: ");
        scanf("%d", &t_f2);
        if(t_f2 > 140 || t_f2 < -93){
            printf("Невiрно введенi температури.\n");
            printf("Бажаєте зробити розрахунки наново: ");
            ch = getch();
            continue;
        }
        printf("Введiть температуру у шкалi Фаренгейта в березнi: ");
        scanf("%d", &t_f3);
        if(t_f3 > 140 || t_f3 < -93){
            printf("Невiрно введені температури.\n");
            printf("Бажаєте зробити розрахунки наново: ");
            ch = getch();
            continue;
        }
        printf("Введiть температуру у шкалi Фаренгейта в квiтнi: ");
        scanf("%d", &t_f4);
        if(t_f4 > 140 || t_f4 < -93){
            printf("Невiрно введенi температури.\n");
            printf("Бажаєте зробити розрахунки наново: ");
            ch = getch();
            continue;
        }
        printf("Введiть температуру у шкалi Фаренгейта в травнi: ");
        scanf("%d", &t_f5);
        if(t_f5 > 140 || t_f5 < -93){
            printf("Невiрно введенi температури.\n");
            printf("Бажаєте зробити розрахунки наново: ");
            ch = getch();
            continue;
        }
        printf("Введiть температуру у шкалi Фаренгейта в червнi: ");
        scanf("%d", &t_f6);
        if(t_f6 > 140 || t_f6 < -93){
            printf("Невiрно введенi температури.\n");
            printf("Бажаєте зробити розрахунки наново: ");
            ch = getch();
            continue;
        }
        printf("Введiть температуру у шкалi Фаренгейта в липнi: ");
        scanf("%d", &t_f7);
        if(t_f7 > 140 || t_f7 < -93){
            printf("Невiрно введенi температури.\n");
            printf("Бажаєте зробити розрахунки наново: ");
            ch = getch();
            continue;
        }
        printf("Введiть температуру у шкалi Фаренгейта в серпнi: ");
        scanf("%d", &t_f8);
        if(t_f8 > 140 || t_f8 < -93){
            printf("Невiрно введенi температури.\n");
            printf("Бажаєте зробити розрахунки наново: ");
            ch = getch();
            continue;
        }
        printf("Введiть температуру у шкалi Фаренгейта в вереснi: ");
        scanf("%d", &t_f9);
        if(t_f9 > 140 || t_f9 < -93){
            printf("Невiрно введенi температури.\n");
            printf("Бажаєте зробити розрахунки наново: ");
            ch = getch();
            continue;
        }
        printf("Введiть температуру у шкалi Фаренгейта в жовтнi: ");
        scanf("%d", &t_f10);
        if(t_f10 > 140 || t_f10 < -93){
            printf("Невiрно введенi температури.\n");
            printf("Бажаєте зробити розрахунки наново: ");
            ch = getch();
            continue;
        }
        printf("Введiть температуру у шкалi Фаренгейта в листопадi: ");
        scanf("%d", &t_f11);
        if(t_f11 > 140 || t_f11 < -93){
            printf("Невiрно введенi температури.\n");
            printf("Бажаєте зробити розрахунки наново: ");
            ch = getch();
            continue;
        }
        printf("Введiть температуру у шкалi Фаренгейта в груднi: ");
        scanf("%d", &t_f12);
        if(t_f12 > 140 || t_f12 < -93){
            printf("Невiрно введенi температури.\n");
            printf("Бажаєте зробити розрахунки наново: ");
            ch = getch();
            continue;
        }
        Med_F = (t_f1 + t_f2 + t_f3 + t_f4 + t_f5 + t_f6 + t_f7 + t_f8 + t_f9 + t_f10 + t_f11 + t_f12)/12;
        printf("Середньорiчна температура у шкалi Фаренгейта: %d\n", Med_F);
        printf("\nТемпература у шкалi Цельсiя в сiчнi: %d\n", (t_f1-32)*5/9);
        printf("Температура у шкалi Цельсiя в лютому: %d\n", (t_f2-32)*5/9);
        printf("Температура у шкалi Цельсiя в березнi: %d\n", (t_f3-32)*5/9);
        printf("Температура у шкалi Цельсiя в квітнi: %d\n", (t_f4-32)*5/9);
        printf("Температура у шкалi Цельсiя в травнi: %d\n", (t_f5-32)*5/9);
        printf("Температура у шкалi Цельсiя в червнi: %d\n", (t_f6-32)*5/9);
        printf("Температура у шкалi Цельсiя в липнi: %d\n", (t_f7-32)*5/9);
        printf("Температура у шкалi Цельсiя в серпнi: %d\n", (t_f8-32)*5/9);
        printf("Температура у шкалi Цельсiя в вереснi: %d\n", (t_f9-32)*5/9);
        printf("Температура у шкалi Цельсiя в жовтнi: %d\n", (t_f10-32)*5/9);
        printf("Температура у шкалi Цельсiя в листопадi: %d\n", (t_f11-32)*5/9);
        printf("Температура у шкалi Цельсiя в груднi: %d\n", (t_f12-32)*5/9);
        printf("\nСередньорiчна температура у шкалi Цельсiя: %d", (Med_F-32)*5/9);
        ch = getch();
    }while((ch != 'Y') || (ch != 'W') || (ch != 'R'));
	return 0;
}
