#include <stdio.h>  // стандартна бібліотека С
#include <locale.h> // містить прототип setlocale() для локалізаціїї

#define nUKR 33 // потужність абетки

void encrypt (int n){ // оголошення підфункції, що шифрує текст
    int marker; // оголошення цілочисельної змінної marker, що показує стан кожного символу в тексті
    char c; // оголошення символьної змінної c, що містить в собі символи з файлу in-text
    FILE *fp1, *fp2; // оголошення даних типу файл, а також їх перелік
    fopen_s(&fp1, "in-text.txt", "r"); // відкрити файл in-text.txt, та прочитати його символи
    fopen_s(&fp2, "out-text.txt", "w"); // відкрити файл out-text.txt, та записати в нього символи
    c = getc(fp1); // отримати символи в файлах
    while (!feof(fp1)){ // поки символи у файлі in-text.txt не закінчилися, виконувати операції в тілі циклу
        marker=0; // початковий стан символу, тобто його ще не було переглянуто
        if (c>= 'А' && c <= 'Я'){ // якщо символ належить цьому проміжку, виконувати операції в тілі оператора
            c=c+(n % nUKR); // присвоїти змінній с нове значення, здвинутись праворуч на n кількість символів
            if (c > 'Я') c = 'А' + (c - 'Я') - 1; // якщо символ покинув межі алфавіту, перенести виконання на початок алфавіту
            fprintf(fp2, "%c", c); // замінює вже прочитаний символ на новий, і вписує його в файл out-text.txt
            marker=1; // присвоєння маркеру значення 1, тобто даний символ вже було прочитано
        }
        if(c>= 'а' && c <= 'я'){ // якщо с належить проміжку, виконувати операції в тілі оператору
            c=c+(n % nUKR); // присвоїти с нове значення та здвинуто її значення на n символів праворуч
            if (c > 'я') c = 'а' + (c - 'я') - 1; // якщо символ с покинув межі алфавіту, перенести виконання на початок алфавіту
            fprintf (fp2, "%c", c); // замінює вже прочитаний символ на новий
            marker=1; // маркер показує, що символ вже переглянуто
        }
        if (!marker) fprintf (fp2, "%c", c); // якщо символ не є літерою, записати його без змін
        c=getc(fp1); // перейти на наступний символ у тексті
    }
    printf ("\aКодування відбулося успішно. Зашифрований текст - y out-text.txt.\n");
     // вивести текст у консоль
    fclose (fp1); // закрити файл (in-text.txt)
    fclose (fp2); // закрити файл (out-text.txt)
}

void decipher (int n){ // оголошення підфункції, що дешифрує текст
    int marker; // оголошення цілочисельної змінної marker
    char c; // оголошення символьної змінної c
    FILE *fp1, *fp2; // оголошення даних типу FILE та перелік цих даних
    fopen_s(&fp1, "out-text.txt", "r"); // відкрити файл
    fopen_s(&fp2, "in-text.txt", "w"); // відкрити файл
    c=getc(fp1); // отримати перший символ рядка файлу out-text.txt
    while (!feof(fp1)){ // поки не кінець файлу out-text.txt, виконувати операції в тілі циклу
        marker=0; // початковий стан символу, його ще не переглянуто
        if(c>= 'А' && c <= 'Я'){ // якщо значення символу належить прміжку, виконувати операції в тілі оператора
            c=c-(n % nUKR); // змінити значення символу с, перемістивши його на n одиниць ліворуч
            if (c < 'А') c = 'Я' - ('А' - c) + 1; // якщо символ покинув алфавіт, перенести його на початок алфавіту
            fprintf (fp2, "%c", c); // переписати символ в in-text.txt
            marker=1; // символ вже переглянуто
        }
        if(c>= 'а' && c <= 'я'){ // якщо значення символу належить проміжку, то виконувати операції в тілі оператора
            c=c-(n % nUKR); // присвоїти змінній нове занчення, здвинувши його ліворуч на n
            if (c < 'а') c = 'я' - ('а' - c) + 1; // якщо значення с покинуло алфавіт, перенести його на початок алфавіту
            fprintf (fp2, "%c", c); // переписати символ в in-text.txt
            marker=1; // символ вже переглянуто
        }
        if (!marker) fprintf (fp2, "%c", c); // якщо символ не є літерою, переписати його без змін у файл in-text.txt
        c=getc(fp1); // перейти на наступний символ файлу out-text.txt
    }
    printf ("\aДекодування відбулося успішно. Розшифрований текст - y in-text.txt.\n"); // вивести текст у консоль
    fclose (fp1); // закриває файл (out-text.txt)
    fclose (fp2); // закриває файл (in-text.txt)
}
int main(void) { // оголошення функції main, з якої починається виконання програми
    char *locale = setlocale(LC_ALL, ""); // локалізація консолі
    int k;  // задати тип ключа k, що відповідає кількості літер в файлі
    char c; // задати тип ключа с, за допомогою нього перевіряється згода користувача
    printf("Шифр Цезаря.\nУведiть значення ключа k: "); // вивести прохання у консоль
    scanf("%d", &k); // отримати значення ключа k у вигляді цілого числа
    getchar(); // затримати результат у консолі
    if (k >= 1) { // якщо значення ключа не менше одиниці, виконати усі операції в тілі оператора
        printf("Зашифрувати текст у in-text.txt? (Y/N)"); // вивести в консоль текст
        scanf("%c", &c); // отримати з консолі сивол ключа с
        getchar(); // затримати результат у консолі
        if (c == 'Y' || c == 'y') encrypt(k); // зашифрувати текст у файлі in-text.txt
        printf("Дешифрувати текст в out-text.txt? (Y/N)"); // вивести текст у консоль
        scanf("%c", &c); // отримати символ с з консолі
        getchar(); // затримати результат у консолі
        if (c == 'Y' || c == 'y') decipher(k); // дешифрувати текст з файлу out-text.txt
    }
    return 0; // отримати результати виконання функції, та закінчити її
}

